Repository: wescamp/White_Troll-1.12
Catalog: po/*.po
Languages: ru

source: The White Troll
ru: Белый Тролль

source: WT
ru: БТ

source: (Easy)
ru: (Лёгкий)

source: Whelp
ru: Новорождённый

source: Troll Child
ru: Тролль-малыш

source: (Normal)
ru: (Нормальный)

source: (Hard)
ru: (Сложный)

source: Young Troll
ru: Молодой тролль

source: An elvish shaman has found a strange white troll whelp abandoned in the mountains near her village. Having seen the diversity of this creature, she has decided to bring him back to her village and to raise him.
ru: Эльфийская шаманка нашла детёныша необычного белого тролля, брошенного в горах рядом с её деревней. Узрев в существе отличие от других, она решила унести его в деревню и взрастить там.

source: (Intermediate level, 8 scenarios.)
ru: (Средний уровень, 8 сценариев.)

source: The White Whelp
ru: Белое дитя

source: Defeat rebel elves
ru: Уничтожение эльфов-повстанцев

source: Death of Brandir
ru: Смерть Брендира

source: Death of Melime
ru: Смерть Мелим

source: Death of the white whelp
ru: Смерть белого троллёныша

source: Lady Erwen
ru: Леди Эрвин

source: Lord Galagor
ru: Лорд Галагор

source: White Troll
ru: Белый тролль

source: Brandir
ru: Брендир

source: Rebel elves
ru: Эльфы-мятежники

source: Hunthor
ru: Гюнтер

source: Melime
ru: Мелим

source: Eruannon
ru: Эруаннон

source: Spies
ru: Лазутчики

source: Tridel
ru: Тридель

source: Romir
ru: Ромир

source: Defeat all enemy spies
ru: Одолейте всех вражеских лазутчиков

source: Any spy reaches the village of Tridel
ru: Любой из лазутчиков добрался до деревни Тридель

source: Jalak
ru: Ялак

source: Back home
ru: Возвращение домой

source: Reach Melime's home
ru: Доберитесь до дома Мелим

source: Death of Eruannon
ru: Смерть Эруаннона

source: Rugnur
ru: Ругнур

source: Glindur
ru: Глиндур

source: Kerin
ru: Керин

source: Mal
ru: Мэл

source: Nij
ru: Нии

source: Quin
ru: Куин

source: Urakim
ru: Ураким

source: Follow the goblin and kill him
ru: Преследуйте гоблина и убейте его

source: Kill all the enemy goblins
ru: Убейте всех вражеских гоблинов

source: Free the Druid from his cage
ru: Освободите друида из заточения

source: Delson
ru: Делсон

source: Death of Delson
ru: Смерть Делсона

source: Mystic pond
ru: Мистический пруд

source: Summon $melime_to_summon creatures with Melime and $eruannon_to_summon creatures with Eruannon
ru: Призовите $melime_to_summon существ для Мелиме и $eruannon_to_summon для Эруаннона

source: Move Delson to the magical lake
ru: Омойте Делсона в магическом пруду

source: Creatures
ru: Твари

source: Turns run out
ru: Закончились ходы

source: The Outpost
ru: Аванпост

source: Elves
ru: Эльфы

source: Glonvan
ru: Глонван

source: Humans
ru: Люди

source: Resist for 25 turns
ru: Удерживайтесь 25 ходов

source: Death of Lord Galagor
ru: Смерть лорда Галагора

source: Please read
ru: Пожалуйста прочтите:

source: This scenario uses a new time of day scheme. Instead of the usual six turns, a day is made of 24 turns, each of them representing one hour. This means that both lawful and chaotic units will have longer periods of bonus and penalty.
ru: Данный сценарий использует новую схему смены дня и ночи. Вместо обычных шести ходов, день занимает 24 хода, каждый из которых равен одному часу. Это означает, что обе стороны - порядочных и хаотичных получат более долгий период бонусов и штрафов.

source: Ameldor
ru: Амельдор

source: Caraldur
ru: Кэралдур

source: Isirion
ru: Изирион

source: Lord Denvan
ru: Лорд Денван

source: Final objective:
ru: Конечная цель:

source: Move Lord Galagor to the tent
ru: Завести лорда Галагора в палатку

source: Try to move as many units as possible to the tent before Lord Galagor, because they will become available for recall in next scenarios.
ru: Попробуйте завести в палатку как можно больше войск раньше лорда Галагора, так они станут доступны для призыва в следующих сценариях.

source: * slash *
ru: * жу-ух *

source: Lost
ru: Заблудившиеся

source: Find a way to leave this place
ru: Найдите путь из этого места

source: Urgh
ru: Эргх

source: Ogres
ru: Огры

source: Trolls
ru: Тролли

source: Bog
ru: Топь

source: Reach the path in the mountains with Urgh and
ru: Дойдите до прохода в горах Эргхом и

source: kill the troll leader (for a bonus)
ru: убейте лидера троллей (для бонуса)

source: kill the troll leader with Urgh (for a greater bonus)
ru: убейте лидера троллей Эргхом (для существенного бонуса)

source: Death of Urgh
ru: Смерть Эргха

source: Gulk
ru: Глуп

source: Clash in the forest
ru: Заруб в лесу

source: Defeat all enemy leaders
ru: Одолеть всех вражеских лидеров

source: Outlaws
ru: Разбойники

source: Hunters
ru: Охотники

source: In this scenario you control two allied sides, each with its own gold, recall and recruit list. Use this fact at your advantage.
ru: В данном сценарии вы ведёте две союзных стороны, у каждой из которых собственное золото и список призываемых/нанимаемых отрядов. Используйте этот факт с умом.

source: The final battle
ru: Решающая битва

source: Defeat Lord Denvan and Hunthor
ru: Поражение лорда Денвана и Гюнтера

source: Rebel Elves
ru: Эльфы-мятежники

source: +$bonusgold gold
ru: +$bonusgold золотых

source: Treehouse
ru: Избушка

source: Animated Rock
ru: Танцующая скала

source: The small, basic stone creatures that are commonly seen dwelling in magical, mountainous areas are aptly named Animated Rocks. Although they are slightly weak, they are obviously quite durable. In addition, they have the ability to draw energy from stone and similar earthen substances to heal themselves, thus making these creatures somewhat longlasting in battle.
ru: Маленькие, обычно каменные создания, что селятся в магических горных областях, метко названы Танцующими скалами. Хотя они относительно слабы, но зато толстокожи. А в добавок обладают способностью высасывать энергию из камня и других земляных субстанций для собственного исцеления, что делает этих существ приспособленными для битвы.

source: fist
ru: кулак

source: female^Elvish Sorceress
ru: Эльфийская шаманка

source: The world of faerie is far more potent than the corporeal world. Simply bringing some of this world into our own can have violent results. This is well-understood by the elves, although rarely used with malicious intent; doing so is no easy task, and is a very ill-regarded use of their strength. Those able to do so are roughly titled as 'sorceresses' by other races; and certainly are capable of acting the part.
ru: Мир фей более насыщенный, чем реальный мир. Простой перенос частицы этого мира в наш может вызвать страшные последствия. Это отлично уяснили эльфы, хотя изредка пользуются этим со злым умыслом; сделать это непросто, и считается плохим тоном использовать данные силы.

source: staff
ru: посох

source: entangle
ru: связать

source: faerie fire
ru: волшебный огонь

source: Young Gryphon
ru: Молодой грифон

source: Gryphons, when young, are covered with white and gray feathers. As soon as they can fly, they become able to defend their nests and to attack intruders. Though not yet powerful as adult Gryphons, underestimate them is a dangerous thing to do, a foolish move that led many poachers to death, either by facing their claws or falling down from a mountain while trying to escape a Gryphon's rage.
ru: Грифоны, когда ещё совсем птенцы, покрыты белыми и коричневыми перьями. Как только у них крепнут крылья, они становятся способными защиать гнездо и нападать на непрошенных гостей. Хотя они не так сильны, как взрослые грифоны, недооценивать их весьма опасно. Такая глупость стоила многим браконьерам жизни, встретивших смерть в когтях, или, спасаясь от ярости грифона, свалившихся со скал.

source: claws
ru: когти

source: Druid
ru: Друид

source: A druid is a mage who has devoted his life to the study of the forces that govern nature. Although a fearsom foe on the battlefield, a druid's real strength resides in his deep knowledge of herbs, animals and plants, which allows him to cast powerful spells.
ru: Друид - это маг, посвятивший жизнь изучению сил дикой природы. Хотя на поле боя он грозный враг, реальная мощь друида заключена в знании - трав, животных и растений - которое позволяет ему насылать мощные заклинания.

source: fireball
ru: шар огня

source: Giant Ant
ru: Гигантский муравей

source: Giant Ants are common in almost any environment, from caverns deep under the earth to the tops of tall mountains. Though normally not hostile, they can bite at close range.
ru: Гигантские муравьи встречаются повсюду, от глубоких пещер под землёй до вершин высочайших гор. Обычно не агрессивные, они могут укусить, если тыкать в них пальцем.

source: fangs
ru: мандибулы

source: Giant Worm
ru: Гигантский червь

source: Usually, earthworms are pretty much inoffensive. But when they're really overgrown, they become a threat that is best avoided if possible.
ru: Обычно, черви намного более безобидны. Но когда они слишком выросли, они становятся проблемой, которой лучше избегать.

source: bite
ru: укус

source: Wose Sapling
ru: молодой леший

source: Rarely seen, even by elves, a Wose is an order of creature about which little is known. The elves are the source of most of this knowledge; they know that these beings are not descended from trees, despite the similarity in form, and they know that a wose is more closely tied to the faerie world than the elves themselves, though in a different way. The motives and workings of their kind are unknown, though most posit the obvious idea that woses are wardens of the natural world. Woses are utterly unwarlike, but possess a great strength. They are, however, neither used to, nor quick at moving around.
ru: Редко встречаемые, даже эльфами, лешие - создания о которых мало что известно. Эльфы основной источник знаний о них; говорят, что они не произошли от деревьев, хотя и похожи внешне, ещё говорят, что лешие ближе к миру фей, чем сами эльфы, только другим образом. мотивы и задачи этих существ неизведанны, хотя многие сходятся в очевидном: лешие - хранители царства природы. Лешие совершенно не воинственны, но наделены огромной силой. Хотя и передвигаются неспешно.

source: crush
ru: сдавливание

source: Great Ogre
ru: Великий огр

source: Great Ogres are giant creatures that usually live alone in the wilderness, remarkably similar to humans in form, though large and misshapen. While they can be easily outrun or outsmarted, their strength is not to be underestimated.
ru: Большие огры - гигантские создания, живущие обычно поодиночке в глуши, весьма похожие на людей по форме, но гораздо больше и уродливей. Не стоит пренебрегать их силой, хотя не составит труда обмануть великанов или сбежать от них.

source: cleaver
ru: тесак

source: Troll Boulderlobber
ru: Тролль-швыряла

source: Some trolls show an uncommon ability in throwing boulders. These Boulderlobbers throw enormous rocks, that common trolls could not even lift and that are often bigger than a man.
ru: Некоторые тролли проявляют недюжую способность к швырянию булыжников. Эти швырялы бросают внушительные куски скал, которые обычные тролли даже не приподнимут, да и рост у них побольше человеческого.

source: sling
ru: праща

source: White Whelp
ru: Белое дитя

source: Describing a troll as a whelp is something of an oxymoron, given that their bodies are already much hardier than that of a grown man. They are clumsy and not yet capable of walking properly, forced instead to shamble about on all fours, but any difficulty this causes them is more than made up for by the raw strength of their race.
ru: Описать тролля, как младенца - подобно оксюморону, поскольку их тела с рождения прочнее, чем у взрослого человека. Они неуклюжи и ещё не могут хорошо передвигаться, вынужденные ползать на четвереньках, но любую трудность встречают с присущей их расе твёрдостью.

source: flame blast
ru: огненый взрыв

source: This unit will repair its body with the rocks found while in/on hills, caves, or mountains, thus recovering 3 HP in the process. The effects of poison will not be prolonged or cured.
ru: Этот боец чинит свое тело при помощи камней найденных в/на: холмах, пещерах или горах, что восстанавливает 3 ОЗ в итоге. Эффект от яда не будет длительным.

source: earth recuperation
ru: высасывание соков земли

source: female^earth recuperation
ru: высасывание соков земли

source: This unit recovers 3 HP per turn when on mountain, cave or debris terrains.
ru: Этот боец восстанавливает 3 ОЗ за ход когда в горах, пещерах или диких землях.

source: Heal +4
ru: Лечит +4

source: Heal +8 and cure poison
ru: Лечит +8 и снимает яд

source: Increase faerie fire damage
ru: Увеличить урон волшебного огня

source: Increase faerie fire hits
ru: Увеличить количество ударов волшебного огня

source: Increase hp
ru: Увеличить ОЗ

source: Regeneration +4
ru: Восстановление +4

source: regenerates
ru: восстанавливается

source: The unit will heal itself 4 HP per turn. If it is poisoned, it will remove the poison instead of healing.
ru: Этот боец будет лечить себя на 4 ОЗ каждый ход. Если он отравлен, он выведет яд вместо лечения.

source: Increase fist damage
ru: Увеличить урон от кулаков

source: Increase fist hits
ru: Увеличить количество ударов

source: Increase flame blast damage
ru: Увеличить урон от взрыва

source: Increase flame blast hits
ru: Увеличить количество взрывов

source: Better movement and defense in forest
ru: Лучше двигается и обороняется в лесу

source: Increase movement
ru: Увеличить движение

source: Noo!! How could we let him die?!
ru: Не-е-ет! Как мы могли позволить ему умереть?!

source: Help meee!!
ru: Помоги-и мне-е-е!

source: No!! Melime!!
ru: Не-е-ет! Мелим!

source: I am done!!
ru: Мне конец!

source: Help!!
ru: На помощь!

source: No!! Without his help we are lost in this abandoned place!!
ru: Нет! Без его помощи мы потеряемся в этом заброшенном месте!

source: Urgh die!!
ru: Эргх умирать!

source: No!! Urgh!
ru: Не-е-ет! Эргх!

source: Eloh, grant me a place in your eternal, evergreen forest...
ru: Элох, отведи мне место в своём вековечном, вечнозелёном лесу...

source: I hereby open this extraordinary session of the elvish council. We gathered here after sorceress Melime's request, and she will now expose the reason that made her ask for our advice.
ru: Настоящим я открываю данный внеочередной совет эльфов. Мы собрались здесь по требованию шаманки Мелим, и сейчас она пояснит нам причину, заставившую её обратиться к нам за советом.

source: Noble council members, I requested this extraordinary session because a few days ago, at the edge of the forest, I found this abandoned troll whelp... and I discovered he has strange magical powers.
ru: Высокородные члены совета, я созвала это внеочередное заседание, поскольку несколько дней назад, на опушке леса я нашла брошенного детёныша тролля... и узрела в нём необычные магические силы.

source: That's impossible! Trolls have never showed any aptitude for magic. Only a few of them are able to learn how to cast spells, and even then they take many years to learn to most basic ones. A troll whelp has about as much magical powers as a stone.
ru: Это невозможно! Тролли ни когда не проявляли способностей к магии. Только некоторые из них оказались способны заучить заклинания, но даже они потратили годы на обучение азам. В этом троллёныше магических сил не больше, чем в камне.

source: This whelp is indeed different: I have seen with my own eyes him using magic with ease more than once.
ru: Этот малыш кардинально отличается: я видела собственными глазами, как он с лёгкостью и неоднократно использовал магию.

source: I sense an unusual power in that troll whelp. I think his magical potential is huge. Anyway, I don't understand how this could be of any concern to us, Melime.
ru: Я чувствую необычную силу в этом отпрыске тролля. Я думаю его магический потенциал весьма велик. Но в любом случае, я не понимаю, как это касается нас, Мелим.

source: I came here to ask you to let me study his powers and let me teach him magic. One day, he could become a valuable ally.
ru: Я пришла просить вас позволить изучить его силы и соизволения обучить его магии. Однажды, он может стать ценным союзником.

source: What?! Do you really mean to teach magic to that... that thing? This proposal is unacceptable, we can not allow this to happen!
ru: Что?! Ты действительно желаешь обучать магии это... существо? Это предложение неприемлемо, мы не позволим этому быть!

source: But he is only a whelp, he hasn't been affected by the warlike nature of his kin yet. I would educate him according to our laws and values.
ru: Но он только дитя, он ещё не был поражён кровожадной природой своего вида. Я воспитаю его в соответствии с нашими законами и ценностями.

source: Do you really think you can turn a wolf into a lamb just feeding it with grass?! Whelps or grown, trolls are bloody beasts: sooner or later he will turn against us.
ru: Ты действительно допускаешь мысль, что волк обратиться в ягнёнка, ели его кормить травой? Дитя или взрослый, тролли кровожадные чудовища: рано или поздно он восстанет против нас.

source: Anger clouds your judgment, Hunthor. This whelp is not responsible for the crimes that his race has committed and of the pain they have caused to you. Melime will be allowed to raise the whelp, but she will be responsible for his behavior.
ru: Злоба затмевает твои суждения, Гюнтер. Это дитя не в ответе за преступления своей расы и боль, причинённую тебе. Мелим будет позволено взрастить дитя тролля, но она полностью ответственна за его поведение.

source: The council has spoken! You, Melime, from now on will take care of this whelp and you will raise him according to our traditions and customs.
ru: Совет вынес вердикт! Ты, Мелим, отныне заботишься о данном младенце, и взрастишь его, и обучишь в наших традициях.

source: I thank you, noble lords. You will not regret of your choice.
ru: Благодарю вас, высокородные повелители. Вы не пожалеете о своём решении.

source: May Eloh let this be. The session is over, the council retires.
ru: На всё воля Эло. Заседание окончено. Совет удаляется!

source: These fools might have been deceived by your promises, but I will not let a monster live peacefully in our village. Nor I will allow him to be taught magic!
ru: Эти дураки может и обманулись твоими обещаниями, но я не позволю чудовищу спокойно жить в нашей деревне. Ни за что не позволю обучать его магии!

source: But he is only a whelp, Hunthor! He has no guilt!
ru: Но, Гюнтер - он всего лишь дитя! Нет на нём вины!

source: Ha! I know his race and I know what they can do. Trolls have slaughtered my father and my brother, without showing any mercy, why should I behave differently? As long as I am alive, no troll will wander freely in my village!
ru: Ха! Я знаком с его расой и я знаю, на что они способны. Тролли разодрали моего отца и брата, безо всякой жалости! Почему я должен поступить иначе? Пока я жив, ни один тролль не выйдет живым из этой деревни!

source: Let us kill the troll! Let us avenge the deaths caused by his filthy race!
ru: Убьём тролля! Отомстим за смерти, причинённые его гнусной расой!

source: Hunthor, the council has spoken and you must respect its decisions. This is our law.
ru: Гюнтер, совет вынес вердикт и ты должен принять их волю. Таков наш закон.

source: A bunch of geriatrics leads us towards doom and I should be watching and do nothing? I don't think so, Brandir. The council's shortsighted behavior risks to condemn us all: it is time for the old system to give way to a new order!
ru: Кучка старпёров ведут нас к погибели, а я должен только наблюдать и бездействовать?! Не думаю, Брендир. Близорукость совета подведёт всех нас: настало время старой системе уступить место новому порядку!

source: Your fury made you lose your mind, Hunthor! Melime, take cover. My soldiers and I will protect you.
ru: Гнев затмил твой разум, Гюнтер! Мелим, в укрытие. Мои солдаты и я - встанем на твою защиту.

source: Argh... I... I surrender.
ru: Оо-ох... Я... Я сдаюсь.

source: My Lord, what are your orders?
ru: Мой господин, какие будут указания?

source: Too much blood has been poured today. I allow you to live, Hunthor, even if your crimes are of the utmost gravity.
ru: Слишком много крови пролилось сегодня. Я дарую тебе жизнь, Гюнтер, хотя низость твоих проступков бездонна.

source: However, you will be exiled from the city, as a punishment for your rebellion.
ru: Отныне ты будешь изгнан из поселения в наказание за своё отступничество и непокорность.

source: The only conduct that deserves punishment is yours, Brandir, you who have chosen to protect a troll rather than your brothers.
ru: Единственный, кто заслуживает кары - это ты, Брендир! Ты, кто предпочёл защищать тролля, вместо своих братьев.

source: I have protected my laws and my people from your madness.
ru: Я защищал наши законы и своих людей от твоего безумия.

source: Hunthor will be back. His hatred has made him lose his mind. Maybe I should have killed him.
ru: Гюнтер вернётся. Его ненависть затмила его разум. Стоило всё же его прикончить.

source: No. Unlike Hunthor, you have acted with wisdom and generosity.
ru: Нет. В отличие от Гюнтера, ты действовал мудро и благосклонно.

source: They have gathered more supporters among our people, we can't face them all!
ru: У них осталось много сочувствующих среди нашего народа, мы не сможем противостоять всем!

source: Me tired. Have break.
ru: Я устать. Ждать отдых.

source: Very well, for today it's enough. Come, Eruannon, let's go back to the village.
ru: Очень хорошо, на сегодня достаточно. Идём, Эруаннон, вернёмся в деревню.

source: Good.
ru: Хорошо.

source: Well, I think I have seen enough.
ru: Итак, я думаю, что увидел достаточно.

source: I found the shaman, Captain. The elf was speaking the truth. The shaman is teaching magic arts to a troll. But they retired into the city and we can't capture the troll.
ru: Я выследил шаманку, капитан. Эльф говорил правду. Шаманка учит каменное чудище магическим искусствам. Но они уже вернулись в город и мы не сможем схватить тролля.

source: We must inform Lord Denvan that the elf's information has been verified. Let's go.
ru: Мы должны доложить лорду Денвану, что информация от эльфа подтвердилась. Уходим.

source: Hurry up, a group of elves is approaching. Probably a border patrol.
ru: Поторопитесь, отряд эльфов идёт сюда. Скорее всего - приграничный патруль.

source: I can't hear anything.
ru: Я ни чего не слышу.

source: Your race has forgotten, if you ever had been able, how to listen to the forest's voice. But I do know how, and I am sure that elves are approaching. We must leave at once.
ru: Ваша раса забыла, если вообще знала, как слушать голос леса. Но я слышу, и уверен, что эльфы скоро прибудут. Мы должны скрыться немедленно.

source: If elves are really coming, I doubt that we can outrun them. Go on without us, Hunthor, to Tridel. Take my ring, show it to the city commander, explain him what's happening and tell him to report to Lord Denvan. He will understand.
ru: Если эльфы действительно идут сюда, я сомневаюсь, что мы сможем убежать от них. Иди в Тридель без нас, Гюнтер. Возьми моё кольцо, покажи командиру городского гарнизона, поясни, что случилось и передай приказ отослать гонца к лорду Денвану. Он поймёт.

source: Some elves are approaching, now I can hear them!
ru: Эльфы идут, я уже слышу некоторых!

source: Humans, why are you in our forest? You are not allowed to be here.
ru: Люди, что забыли вы в наших лесах? Вам не позволено быть здесь.

source: My Lord, that looks like the man who was seen sneaking around our village.
ru: Мой господин, этот человек похож на замеченного около деревни шпиона.

source: Who are you? Why are you spying on us?
ru: Кто ты такой? Почему шпионил за нами?
