Repository: wescamp/White_Troll-1.12
Catalog: po/*.po
Languages: ru

source: If you really want to continue questioning my orders, may I remind you that there is a pole ready for you, my dear inferior?
ru: Если ты действительно желаешь продолжить обсуждать мои приказы, могу я напомнить, что у нас давно готов кол для тебя, мой дорогой прислужник?

source: <i>(gulp)</i> Yes, my Lord! I'll... go... find my troops... immediately.
ru: <i>(сглотнул)</i> Да, милорд! Я... бегу... искать людей... немедленно.

source: Seriously?! I heard that there is an economic crisis in Wesnoth, but an army recruiting critters is just utterly crazy!
ru: Серьёзно?! Я слышал о экономическом кризисе в Весноте, но что в армию нанимают чудищ - просто сумасшествие!

source: Die! Your evil rule is over!
ru: Умри! Твоё злобное правление окончено!

source: You... you tree-huggers... be damned forever...
ru: Вы... древолюбы... будьте прокляты...

source: He is gone... No more gold for us, let us leave the field at once.
ru: Всё пропало... Больше никакого золота, разбегаемся.

source: Please... spare me!
ru: Пожалуйста... пощади меня!

source: You have had your chance, you have rejected it. Our laws are clear, your punishment will be death.
ru: У тебя был шанс, ты его отверг. Наши законы кристально ясны: твоё наказание - смерть.

source: But...
ru: Но...

source: Farewell Hunthor.
ru: Прощай, Гюнтер.

source: Any of the elves that has followed Hunthor in his crazy rebellion is welcome to come back with us, as long as they are willing to fight with us and respect our laws.
ru: Любой из эльфов, что следовал за Гюнтером в его безумном восстании, может покаяться и вернуться, при желании сражаться на нашей стороне и уважать наши законы.

source: There are too many of them!
ru: Их слишком много!

source: The village is lost!
ru: Деревня потеряна!

source: We did it! We defeated them all!
ru: Мы сделали это! Мы всех победили!

source: Yes, but at what cost? Too many died today, our life will never be the same after this day.
ru: Да, но какой ценой? Слишком многие погибли сегодня, наша жизнь никогда не станет прежней после этого дня.

source: You put an end to Lord Denvan's tyranny, and we thank you for this, Elves.
ru: Вы положили конец тирании лорда Денвана, и мы благодарим вас за это, эльфийский народ.

source: Who are you?
ru: Кто вы?

source: We were members of the city council, we left the village when Denvan seized the power because we didn't agree with his ideas. Now we can hopefully work to restore the peace, and to regain the trust of your people, that we have lost because of Denvan.
ru: Мы члены городского совета, мы оставили поселение, когда Денван набрал силы, поскольку были не согласны с его идеями. Теперь, надеемся, мы сможем восстановить мир, и заслужить доверие ваших людей, которое мы утратили из-за Денвана.

source: This would be more than welcome. We all need peace after these events.
ru: Это более чем приветствуется. Нам всем нужен мир после всего произошедшего.

source: And you, Urgh? What will you do now?
ru: А ты, Эргх? Что ты будешь делать?

source: Urgh thank good elf for help, now Urgh know elf good no only to eat. And Urgh happy Urgh help elf.
ru: Эргх говорить спасибо хорошим эльфам за помощь, теперь Эргх знать - эльф хороший не только как еда. И Эргх рад, Эргх помочь эльфы.

source: But now Urgh clan chief, Urgh need find new home to clan, or clan be finish. Urgh think troll walk to hills North, then troll can find good place.
ru: Но теперь Эргх вождь племени, Эргх нужно найти дом для семья, или клан капут. Эргх думать тролли идти в горы север, тролли найти хорошее место там.

source: Your help, and that of your clan, has been precious for us. Now we know that not all trolls are evil. We all want to thank you and wish you a happy life.
ru: Твоя помощь, и твоей семьи, была неоценима для нас. Теперь мы знаем, что не все тролли - зло. Мы все благодарим тебя и желаем счастливой дороги.

source: Urgh need leave place. Urgh no welcome by troll these hills. Urgh think walk East, and hope find place to live with new troll clan.
ru: Эргх должен уйти. Эргх не любить тролли тут. Эргх думать идти на восток, надеется найти место для жизни с новая семья.

source: Your help has been precious for us. Now we know that not all trolls are evil. We all want to thank you and wish you a happy life.
ru: Твоя помощь была неоценима для нас. Теперь мы знаем, что не все тролли - зло. Мы все благодарим тебя и желаем счастливой дороги.

source: Me want go with Urgh.
ru: Я хотеть идти с Эргх.

source: Eruannon, what are you saying? This is your home, why do you want to leave?
ru: Эруаннон, что ты такое говоришь? Это твой дом, зачем тебе уходить?

source: Bad man want me to do hurt to elf and troll. Me no like it, no want it happen again. Me go with troll, be happy with them. But me remember good elf always.
ru: Плохой человек, хотеть я обижать эльфы и тролли. Я не любить это, не хотеть это снова. Я уходить с тролль, быть счастлив с ним. Но помнить хороших эльфов всегда.

source: I...
ru: Я...

source: Farewell, Eruannon. We will always remember you as well.
ru: Прощай, Эруаннон. Ты навсегда останешься в наших сердцах.

source: +2 mana
ru: +2 маны

source: +1 mana
ru: +1 мана

source: +$mana_bonus mana
ru: +$mana_bonus мана

source: +3 mana
ru: +3 маны

source: +$($unit.level*5) mana
ru: +$($unit.level*5) маны

source: Warning
ru: Предупреждение

source: This campaign uses some features that are missing or bugged in Wesnoth versions older than 1.11.10. Please update your Wesnoth in order to play it.
ru: Данная кампания использует некоторые особенности, которые отсутствуют или сломаны в версиях ниже, чем 1.11.10. Пожалуйста, обновите ваш Веснот дл полноценной игры.

source: Before we start, we'd like to thank all the guys from WIF, who made the creation of this campaign possible, with a special mention for mich, Gadenz, Dibs, Relive, Sharpshooter, Arwen, Baro_st, Tydeus, Elvish_Hunter, Uesmae, Dorimen, miky, and zepko. Without them, this campaign wouldn't exist (we hope we haven't forgotten anyone). Besides this, many thanks to you who are trying it, and if you find errors or problems you are welcome to highlight them in the dedicated forum thread. So, here we go.
ru: Перед тем, как начать, автор сценария желает поблагодарить всех парней из WIF, которые сделали возможным создание этой кампании, с особой благодарностью к Gadenz, Dibs, Relive, Sharpshooter, Arwen, Baro_st, Tydeus, Elvish_Hunter, Uesmae, Dorimen, miky, и zepko. Без них, эта кампания не существовала бы (надеюсь никого не забыл). Ко всему, огромная благодарность всем, кто скачал данное дополнение: если вы нашли ошибку или баг - всегда рады видеть вас в специальной ветке форума. <small>Русский перевод от TreefeedXavier.</small> Итак, начинаем.

source: It was a time of peace in the lands of Wesnoth, King Konrad and Queen Li'sar were ruling with fairness and wisdom on the newly liberated countries of men. It looked like a new era was upcoming, an era of peace and cooperation among the races. Humans, elves and dwarves were finally living together in harmony, but a totally unpredictable event was to affect this idyllic atmosphere of peace and serenity.
ru: Это было время мира в землях Веснота, король Конрад и королева Лисар, правили мудро и справедливо в новом свободном царстве людей. Казалось, это заря новой эры, времени мира и сотрудничества между расами. Люди, эльфы и гномы наконец жили все вместе в гармонии, но совершенно не предсказуемое событие нарушило идеальную атмосферу мира и спокойствия.

source: Our story is set in the North, near the edge of impassable peaks and the borders of the kingdom on Knalga and the Great River... an idyllic place where, shadowed by high mountains, stood a small forest, peacefully inhabited by a medium elvish community, with a human village a few miles away... In their small town, the elves used to spend peacefully their semi-eternal lives honoring the trees and walking long promenades under high branches.
ru: Наша история начинается на севере, у подножья непроходимых гор и границ королевства Кналга, тянущихся вдоль Великой реки... идеалистическое место, где в тени высоких гор, стоял маленький лес, населённый мирными эльфами, соседствующих с человеческой деревушкой в нескольких милях к западу... В своём небольшом поселении, эльфы проводили свои полу-бессмертные жизни в уходе за деревьями и в долгих прогулках под высокими кронами.

source: Where the forest slowly left ground to the mountain, we could have noticed a small cottage, built from the trunk of a big tree, where an elf lived lonely and far from her kin, a sorceress whose beauty was both astonishing and ethereal, Melime. Every morning, Melime used to walk through that corner of forest in which she lived, until she reached the first slopes of high mountains, and then she slowly returned to her home.
ru: Там где опушка леса постепенно уступала землю горным кряжам, вы могли заметить маленький домик, выдолбленный в стволе большого дерева, где одна, в дали от своего рода, жила колдунья, чья красота была изумительна и вечна - эльфийка Мелим. Каждое утро Мелим пересекала отрезок леса, в котором жила, доходила до первых горных насыпей, и затем не спеша возвращалась домой.

source: One morning, however, Melime diverted from her usual path, attracted by a strange noise; she reached the farthest edge of the forest and discovered, with great surprise, the source of the noise... a small troll whelp, completely white, was gracelessly lying blocked under a boulder, frantically screaming in his guttural language. Moved to compassion by the sight, Melime rescued him using a spell and the whelp meekly approached her and started to follow her on her way home.
ru: Однажды с утра, Мелим отклонилась от привычного маршрута, привлечённая странным шумом; она добралась до дальнего края леса и обнаружила, к большому своему удивлению, источник странных звуков... маленького младенца тролля, полностью белого, придавленного камнем и отчаянно рычащего во всю глотку. Почувствовав сострадание к найдёнышу, Мелим спасла его при помощи заклинания; оправившись от шока, малыш стал неотступно следовать за ней до самого дома.

source: Right before reaching her home, the graceful elvish shaman was attacked by a wild beast; but even before she could strike it with a spell, the beast was engulfed by tongues of fire that made it flee in fear... the shaman turned towards the source of those flames and saw the troll, whose hands were still emanating a wisp of smoke... it was now clear that the troll, completely different from his kin, was able to use magic.
ru: Перед самым домом добрая эльфийская шаманка подверглась нападению диких зверей; но прежде чем она успела произнести заклинание, на чудищ обрушилась масса огня, заставив их в страхе бежать... шаманка огляделась вокруг, в поисках источника пламени, и увидела тролля, с кулаков которого всё ещё поднимался дымок... стало понятно, что этот тролль полностью отличается от своих сородичей, и может использовать магию.

source: With this new awareness, she brought him to her house, where they lived peacefully for a week, and the troll learned surprisingly fast the elvish language, also increasing his size and powers. On the seventh day, the shaman decided to ask for the city lords' advice, even if in her heart she had already started to care about the whelp's fate, whom she had called Eruannon. So, together with little Eruannon, she headed towards the elvish city.
ru: С этим новым знанием, она забрала тролля к себе домой, где он мирно прожил неделю, довольно быстро обучился эльлфийскому языку, подрос и окреп. На седьмой день, шаманка решила спросить совета городских старейшин, хотя в глубине души уже решила заботиться о судьбе троллёнка, которого назвала Эруаннон. Итак, вместе с малышом Эруанноном, она направилась в поселение эльфов.

source: Hunthor's thirst for revenge was great. Exiled from the elves, he turned to a race he despised to satisfy his anger. At the village of Tridel he explained the situation to the human commander.
ru: Жажда мести Гюнтера была безгранична. Изгнанный от эльфов, он обратился к расе, которую считал подходящей для удовлетворения своего гнева. В деревне Тридель он пояснил ситуацию городской страже.

source: The commander wanted to know everything about this magical troll, but from a distrust of elves, he sent a patrol into the forest to gather information about the elvish village and how the troll was protected. If the opportunity arose, they were to capture the creature.
ru: Коммандор стражи захотел узнать всё о магическом тролле, но не доверяя эльфу, выслал лазутчиков в лес для сбора информации об эльфийской деревне и разведки - насколько беззащитен тролль. Если возникнет такая возможность, они должны были схватить тролля.

source: Given the growing human threat to the village, the council decided that Eruannon and Melime must be better protected, so they decided that Melime and the troll should return to her home deeper in the forest. Brandir offered to escort and guard them.
ru: Видя что людская угроза деревне растёт, совет постановил, что Эруаннон и Мелим должны быть лучше защищены, а по сему обязаны вернуться в свой дом в чаще леса. Брендир вызвался сопровождать и защищать их.

source: So the three quickly made their way through the forest, until they were in sight of the beautiful treehouse.
ru: Таким образом троица быстро продвигалась по лесу, пока не увидела вдалеке красивый дом в стволе дерева.

source: Cleaned the caves from the goblins, the group returned to Melime's house, accompanied by the druid, whose name was Delson.
ru: Очистив пещеры от гоблинов, группа вернулась в дом Мелим, в компании друида по имени Делсон.

source: Melime and Brandir learned that Delson was a powerful mage, interested in the magic of the earth and of the elements, who had pursued long studies in remote regions. However, long years of solitude had somewhat influenced his mind...
ru: Мелим и Брендир поняли, что Делсон могущественный маг, интересующийся магией земли и элементов, и проводящий долгие изыскания в отдалённых районах. Хотя, долгие годы одиночества некоторым образом повлияли на его разум...

source: Lost in the middle of nowhere, our heroes were completely unaware of what was going on in their village, and especially how the situation had evolved with the hostile humans. Let us have a look...
ru: Блуждающие среди неизведанных земель, наши герои совершенно не знали, что происходит в их деревне, и особенно, как развивается ситуация с агрессией людей. Давайте посмотрим...

source: The elves had managed to gather their army and they feared that the humans could attack them from two fronts, directly in the village and coming from the North. So the council sent their best commander, Lord Galagor, to hold the northern front, together with a bunch of chosen fighters.
ru: Эльфам удалось собрать армию, но они опасались наступления людей одновременно по двум фронтам: с севера и непосредственно из поселения. Совет решил послать лучшего командующего, лорда Галагора, для укрепления северной границы, вместе с отрядом лучших бойцов.

source: But the humans had gathered a powerful army too, and they had planned to take the elves unprepared attacking them from the North.
ru: Но и люди созвали огромную армию, рассчитывая застать эльфов врасплох атакой с севера.

source: So the two armies faced each other at the edge of the forest. The humans had failed to take the elves by surprise, but their numerical advantage was clear. After two days and two nights in which none of the contenders dared to make a move, except for minor skirmishes on both sides, the humans launched a massive attack against the elvish defenses. Great losses followed from both sides, so the elves withdrew to an abandoned human fortress built on the near hills.
ru: И так две армии встретились на опушке леса. Люди упустили возможность неожиданно напасть, но их численное превосходство было на лицо. После двух дней и двух ночей, за которые ни одна из сторон не решалась напасть, за исключением небольших стычек, люди начали массированную атаку против укреплений эльфов. Огромные потери последовали с обеих сторон, и эльфы были оттеснены к старой заброшенной крепости, построенной на холмах.

source: The position was in favor of the elves, but time played against them, besieged by a well supplied human army...
ru: Позиция давала преимущество эльфам, но время играло против них, поскольку армии людей отлично снабжались...

source: Once they had left Delson to his studies, Brandir, Melime and Eruannon decided that the fastest way back to their village was to follow the stream flowing out the pond, rather than facing again the long and dangerous path through the mountains.
ru: Оставив Делсона с его изысканиями, Брендир, Мелим и Эруаннон решили что быстрейший путь к деревне будет лежать вдоль реки, вытекающей из пруда. Гораздо удобнее, чем опять идти опасными горными тропами.

source: However, the stream soon turned into a big river, whose fast current flowed through almost vertical cliffs, impossible to climb or pass. So the three were forced to descend the current holding to the trunk of a fallen tree.
ru: Но, ручей вскоре стал полноводной рекой, текущей меж отвесных скал, не позволяющих ни подняться, ни обойти их. Наша троица вынуждена была сплавляться вниз по течению на стволе поваленного дерева.

source: Finally, the river flowed into a lake, shining like a gem surrounded by a crown of impassable peaks. Here, the current slowed down, before leaving the lake with a spectacular waterfall.
ru: Наконец, река впала в озеро, сверкающее как бриллиант в окружении непроходимых гор. Здесь поток замедлялся, перед тем как покинуть озеро в умопомрачительном водопаде.

source: Lord Galagor, barely escaped from the siege with only a few soldiers, was rapidly heading back to his village. He was only a couple days away, but the sinister threat made by Lord Denvan when he crossed the bridge was still echoing in his mind, not without reason.
ru: Лорд Галагор, едва спасшись из осады всего с несколькими солдатами, стремительно продвигался назад к деревне. Он отсутствовал всего пару дней, но подлая выходка лорда Денвана, когда они пересекали мост, всё ещё горела в его сознании, и не без причины.

source: Our heroes, having defeated the numerous outlaws group, felt confident about their strength, so they rushed towards their village, sure that Lord Denvan would attack soon.
ru: Наши герои, разбив внушительные орды разбойников, уверенные в своих силах, мчались к деревне, уверенные, что лорд Денван вскоре нападёт.

source: But when they spotted the huge human army approaching, their confidence began to faint...
ru: Но когда они узрели размеры прибывшей людской армии, их уверенность стала спадать...

source: Summon
ru: Призыв

source: This unit can summon new units near her, but not in villages.
ru: Этот боец может призывать новых существ рядом с ней, но не в деревнях.

source: This unit can summon new units near him, but not in villages.
ru: Этот боец может призывать новых существ рядом с ним, но не в деревнях.

source: Summon with Melime
ru: Призвать для Мелим

source: Currently I have $summoner.variables.mana mana points. What do I have to summon?
ru: Сейчас у меня $summoner.variables.mana единиц маны. Кого бы мне призвать?

source: Nothing.
ru: Ничего.

source: A Giant Ant.
ru: Гигантский муравей.

source: Cost: 5 mana
ru: Стоит: 5 маны

source: evocation
ru: воссоздание

source: A Sapling Wose.
ru: Молодой леший.

source: Summon with Eruannon
ru: Призвать для Эруанонна

source: A Mudcrawler.
ru: Грязеполоз

source: Cost: 3 mana
ru: Стоит: 3 маны

source: An Animated Rock.
ru: Танцующая скала

source: Summon with Delson
ru: Призвать Делсоном

source: Cost: 8 mana
ru: Стоит: 8 маны

source: A Giant Scorpion.
ru: Гигантский скорпион

source: A Wose.
ru: Леший

source: Cost: 7 mana
ru: Стоит: 7 маны

source: this unit can create other units in the near free spaces, but not in villages.
ru: этот боец может создавать других бойцов на свободных клетках вокруг себя, но не в деревнях.
