Repository: wescamp/White_Troll-1.12
Catalog: po/*.po
Languages: ru

source: Yes, very good. But, where are we?
ru: Да, очень хорошо. Но, где мы?

source: I have no idea, but no wonder nobody knew about the existence of this lake. Look at the mountains around, it seems that the only way to reach the lake is through the river.
ru: Не знаю точно, но надеюсь никто не знает о существовании этого озера. Посмотри на горы вокруг, кажется что единственный путь сюда лежит по реке.

source: So we should continue to follow the river.
ru: Нам следует продолжать идти по течению.

source: That won't be so easy. Listen to this roar. There must be a big waterfall somewhere east, that also causes this fog.
ru: Это будет не легко. Прислушайся к рокоту. Похоже рядом большой водопад, в восточной стороне. Он и причина этого тумана.

source: Nonetheless, we should at least try. I suggest that we travel east and see if we can find a way. The lake seems to be deep and cold, we should try to avoid it whenever possible.
ru: Тем не менее, мы должны хотя бы попытаться. Я полагаю, нам следует отправиться на восток и поискать проход. Озеро глубокое и холодное, по возможности, не следует мочить ноги.

source: Agreed.
ru: Согласна.

source: What am I doing here? I'm a soldier, I should be leading my troops on the front!
ru: Что я делаю тут? Я - солдат, и должен сопровождать своих людей в битве!

source: You are here to protect me and Eruannon. And believe me, Brandir, I could not desire a better protector.
ru: Ты здесь для защиты: меня и Эруаннона. И поверь мне, Брендир, я и не мечтала о более достойном защитнике.

source: A troll! Stand back, Melime, I'll cover you!
ru: Тролль! Назад, Мелим, я прикрою!

source: Urgh... Urgh make no harm to elf. Elf no harm to Urgh.
ru: Эргх... Эргх не бить эльфа. Эльф не бить Эргх.

source: Careful, don't trust him.
ru: Осторожно. Не верь ему.

source: Urgh home with clan across lake. But big nasty ogre took island and Urgh lost here with whelps. Urgh want go home.
ru: Эргх, дом, семья, около озера. Но большой злой огр забрать землю и Эргх теряться маленьким. Эргх хотеть домой.

source: He doesn't look hostile...
ru: Он не выглядит враждебно...

source: Be careful...
ru: Будь <b>осторожна</b>...

source: Er... sir, Urgh, we are looking for a way to follow the river downstream, past the waterfall, towards our beautiful village in the forest. Could you please show us a way? We would be very grateful.
ru: Эм... сэр Эргх, мы ищем проход вниз по реке, мимо водопада, к нашей прекрасной деревне в лесу. Не могли бы вы быть столь любезны указать нам путь? Мы были бы вам весьма признательны.

source: Urgh no understand difficult elf word. Elf want trick Urgh with word, then elf harm Urgh. <big><b>Urgh angry! Urgh kill elf!</b></big>
ru: Эргх не понимать тяжёлых эльфийских слов. Эльф хотеть обмануть Эргх словами, потом эльф хотеть делать больно Эргх. <big><b>Эргх злиться! Эргх бить эльф!</b></big>

source: Uh oh...
ru: Ух ух...

source: Eruannon! Where are you going? Come back!
ru: Эруаннон! Куда ты? Вернись!

source: Me troll...
ru: Я тролль...

source: Rok! Rok alive! Good news but bad news!
ru: Скал! Скал жив! Хорошие новости, но плохие новости!

source: Urgh, do you know Eruannon?
ru: Эргх, ты знаешь Эруаннона?

source: White whelp name Rok. Rok son chief Bog. But Rok white and strange, so chief tell Urgh kill Rok. But Urgh think poor Rok good whelp, so Urgh no kill Rok, but leave Rok in forest, so Rok maybe live.
ru: Белое дитя с именем Скал. Скал сын вождя Болото. Но Скал белый и странный, вождь сказал Эргх убить Скал. Но Эргх думать бедный Скал - хорошенький, и Эргх не убить Скала, оставить одного в лесу, возможно Скал выживет.

source: But now Rok back, chief no happy when see. And chief kill Urgh, then kill Rok, then kill elf, and eat all!
ru: Но теперь Скал вернуться, вождь не быть счастливый. Вождь убить Эргх, убить Скал, убить эльф, и сожрать все их останки!

source: So, your chief told you to kill the white whelp, but you did not kill him and left him in the forest. That's where I found him. Urgh, you saved his life.
ru: Итак, твой вождь заставил тебя убить белого троллёныша, но ты не убил его, а оставил в лесу. Там я его и нашла. Эргх, ты спас ему жизнь.

source: Urgh shaman, Urgh know white whelp special. Never see one before. White whelp great power, but white whelp different, warrior troll afraid of different. Now chief kill all!
ru: Эргх - шаман, Эргх знать - белое дитя особое. Никогда не видеть такое прежде. Белое дитя с огромной силой, но белое дитя не такой как все, войны бояться тех, кто отличается. Теперь вождь убить всех!

source: Not a pleasant thought. Listen, Urgh, we must leave this place. Can you show us a way to stay away from the troll chief?
ru: Не слишком миролюбиво. Послушай, Эргх, нам нужно выбраться из этого места. Можешь показать нам путь, пролегающий поодаль от вождя троллей?

source: And don't forget the ogres on the island.
ru: И не забудь об ограх на острове.

source: No way this shore. Elf can jump, but big jump for elf. Elf be crash on rock. Must cross lake. Secret path, only Urgh know, near water. Safe way. But near chief home. But only way. Urgh guide elf. Urgh must leave.
ru: Нет пути этот берег. Эльф может прыгать, но слишком большой прыжок для эльфа. Эльф разбиться о скалы. Должны пересекать озеро. Тайный путь, только Эргх знать, рядом с вода. Безопасно. Но рядом с пещерой вождя. Но только этот путь. Эргх вести эльфа. Эргх уходить.

source: Are we crazy? Following a troll towards his home?
ru: Вы с ума сошли? Идти за троллем, прямиком к его дому?

source: Please, trust him. I believe we can follow him.
ru: Пожалуйста, доверься ему. Я думаю, мы можем пойти с ним.

source: Oh, alright. But only because I trust you, not him.
ru: О, да. Но только потому, что я верю <i>тебе</i>, а не ему.

source: Well, our way is across the lake. Have your weapons ready, we will have to fight. And you two had better summon some creatures.
ru: Хорошо, наш путь лежит вдоль озера. Оружие наизготовку, возможен бой. И вам двоим лучше призвать несколько тварей.

source: Urgh whelps come too.
ru: Малыши Эргха тоже идти.

source: And Melime...
ru: И Мелим...

source: Yes?
ru: Да?

source: Stay near me. I don't trust these trolls.
ru: Держись рядом. Я не доверяю этим троллям.

source: It seems you have finally found your troops to lead in battle, right Brandir?
ru: Только посмотри: ты, наконец, нашёл, кого вести в бой, а Брендир?

source: Here secret path. Elf follow Urgh, fast. Path long.
ru: Вот тайный проход. Эльф идти за Эргх, быстро. Путь длинный.

source: You have been a good guide, Urgh, I have to say it. But I have a question for you. How have you trolls learned our language?
ru: Ты отличный проводник, Эргх, смею заметить. Но у меня к тебе вопрос: Как вы тролли выучили наш язык?

source: When troll catch elf to eat, sometime elf speak and say troll no eat elf. Why they say? What troll do with elf if no eat? But before eat troll listen and learn elf word, troll no dumb as elf think.
ru: Когда тролль ловить эльфа, иногда эльф говорить не кушать эльф. Зачем говорить так? Что тролль делать эльф, если не кушать? Но перед едой тролль слушать и запоминать эльфийские слова, тролль не тупой, как эльфы думать.

source: Very reassuring...
ru: Весьма утешительно...

source: Urgh lost, way closed, no escape. All die here.
ru: Эргх потеряться, путь перекрыт, нет спасенья. Все умирать тут.

source: I told you, trusting a troll...
ru: Я говорил: доверься троллю...

source: Nasty ogre dead! Good elf kill bad ogre!
ru: Страшный огр мёртв! Хороший эльф убил плохой огр!

source: Now let's try to avoid trolls as much as we can.
ru: Теперь попробуем избегать троллей как можно дольше.

source: Bad chief dead! Now clan dead, all troll must go away.
ru: Плохой вождь мёртв! Теперь клан мёртв, все тролли уходить.

source: Maybe they can come with us, help us.
ru: Может они последуют за нами и помогут?

source: Are you crazy?? Let's flee while they are still confused for the death of their chief.
ru: Ты с ума сошла?! Давай бежать, пока они в растерянности от смерти вождя.

source: Urgh smash bad chief! Now Urgh new chief! Troll obey Urgh or Urgh smash all troll!
ru: Эргх крушить плохой вождь! Теперь Эргх новый вождь! Тролли подчиниться Эргх или Эргх сокрушить всех троллей!

source: And now, what will you do, Urgh?
ru: И теперь, что ты будешь делать Эргх?

source: Urgh clan help whelp Rok and good elf. Then Urgh find new home for clan. Here bad.
ru: Клан Эргха помогать малышу Скале и хорошему эльфу. Потом Эргх найти новый дом для клана. Тут плохо.

source: Let's go then.
ru: Тогда идём.

source: Elf wait. First Urgh eat dead chief body. So dead chief no more.
ru: Эльф жди. Сначала Эргх кушать мёртвый вождь. Что бы не стать старого вождя.

source: That's disgusting!
ru: Это отвратительно!

source: Here troll chief Bog. Rok father. Elf careful.
ru: Это вождь троллей Болото. Отец Скала. Эльф беречь себя.

source: Elf in troll home. Smash elf! Eat elf! But white whelp alive... Urgh cheat Bog! Bog smash white whelp and Urgh and elf, then eat all! <big><b>Bog angry!</b></big>
ru: Эльф в доме тролля. Крушить эльф! Съесть эльф! Но... белый малец жив... Эргх обмануть Болото! Болото крушить белого недоросля, и Эргха, и эльфа, и кушать их всех!<big><b>Болото зол!</b></big>

source: Father...
ru: Отец...

source: Bog no father to strange white whelp. BOG SMASH ALL!
ru: Болото не отец белого уродца. БОЛОТО КРУШИТЬ ВСЕХ!

source: There's no way to discuss with him. Whether we avoid him or we kill him. Otherwise...
ru: Похоже, тут нечего обсуждать. Или мы бежим от него или мы убиваем его. Или...

source: Don't even say it! I haven't traveled this far to be eaten by a dumb troll like this.
ru: Даже не смей это сказать! Я не для того зашёл так далеко, что бы меня сожрал тупой тролль, типа этого.

source: Urgh wait. Gulk follow Urgh. Urgh friend.
ru: Эргх жди. Глуп идти с Эргх. Эргх друг.

source: Gulk friend to Urgh. Gulk follow Urgh.
ru: Глуп друг Эргх. Глуп идти за Эргх.

source: Perfect... more trolls...
ru: Великолепно... ещё тролли...

source: We are almost home, we should be safe in our lands for the moment.
ru: Мы почти дома, в наших землях мы будем в безопасности.

source: Look, my Lord! Some hunters have set their encampment right in the middle of our woods. And look! They have burned down our beloved trees just to build their graceless buildings! We must talk to them!
ru: Посмотрите, мой господин! Некоторые охотники поставили палатки прямо посреди нашего леса. И гляньте! Они жгут наши любимые деревья, что бы освободить место для своих... непривлекательных строений! Мы должны поговорить с ними!

source: I fear that we will have to do something more than talk to them. They must be the servants Denvan was talking about. They look more like outlaws than regular soldiers, yet they are well armed and seem ready to fight.
ru: Я боюсь, мы должны сделать нечто большее, чем просто поговорить. Это должно быть подчинённые Денвана, о которых он упоминал. Они выглядят скорее как разбойники, чем как солдаты, но хорошо вооружены и готовы к битве.

source: Look, the elves are finally approaching. We must prevent them from reaching their village. If we stop them now, the village gold will be ours. With that together with what Lord Denvan will pay to us, we will be rich for the rest of our lives.
ru: Смотрите, эльфы прибыли наконец. Мы должны помочь им <b>не</b> добраться до поселения. Если остановим их сейчас, сокровища деревни будут наши. Вместе с золотом, что обещал нам Денван, этого хватит до конца наших дней.

source: Lord Denvan was right, there are only few of them, and exhausted by the battle and the escape. It will not be hard to deal with them.
ru: Лорд Денван был прав: их всего горстка, изнурённых битвой и бегством. Будет не сложно одолеть их.

source: Lord Denvan is always right, remember this.
ru: Лорд Денван <b>всегда</b> прав, заруби себе на носу.

source: Even when he calls you <i>his inferior?</i>
ru: Даже когда зовёт тебя <i>мой прислужник</i>?

source: Actually it is <b>you</b> that he calls <i>his inferior</i>.
ru: Вообще то он <b>тебя</b> зовёт <i>мой прислужник</i>.

source: Well, since <b>you</b> are <b>my</b> inferior, go there and bring me the elf's head.
ru: Хорошо, но поскольку ты <b>мой</b> прислужник, пошёл и притащил мне голову эльфа! Быстро!

source: I guess that another candle to Eloh will be needed if I see my home again.
ru: Я подумал, одной свечи для Эло будет мало, если я всё же увижу дом.

source: Urgh tired, path long and no food. But Urgh see human, Urgh never try human, maybe human tasty.
ru: Эргх устать, долгий путь, еды нет. Эргх видеть человек, Эргх не кушать человек ещё, думать теперь, что человек вкусный.

source: Trolls are coming down the hills! Be ready to face them! I fear this will be our fall, but many of them will come with us.
ru: Тролли спускаются с холмов! Будьте готовы! Я боюсь, что нас сомнут, но мы заберём с собой многих!

source: Trolls... I hate those filthy beasts.
ru: Тролли... Ненавижу этих гнусных чудовищ.

source: But they are not our target. Stay away from them and concentrate on the elves. Maybe the trolls will attack the elves too.
ru: Не они наша цель. убирайтесь от туда и сконцентрируйтесь на эльфах. Может тролли нападут и на эльфов.

source: See elf! Elf tasty!
ru: Видеть эльф! Эльф вкусный!

source: Elf also tasty, but Urgh no eat elf now.
ru: Эльф тоже вкусный, но Эргх не кушать эльф теперь.

source: Why no eat elf?
ru: Почему "не кушать эльф"?

source: Urgh now friend to elf. Elf help Urgh, and Urgh help elf.
ru: Эргх теперь друг эльф. Эльф помочь Эргх, а Эргх помочь эльф.

source: What's happening here? My Lord, what are you doing here?
ru: Что случилось? Мой господин, что вы тут делаете?

source: Brandir, my old friend! Eloh must have sent you! We were besieged by a great human army in the North, we barely escaped with our lives, but now these outlaws are threatening us. We are outnumbered, we can't resist for long!
ru: Брендир, мой старый друг! Не иначе Эло послала тебя! Нас обложила великая армия людей с севера, мы едва спасли свои жизни, но теперь эти разбойники терроризируют нас. Нас слишком мало, что бы долго сопротивляться!

source: Don't worry, my Lord, we will fight together once more, and these invaders will have no chance. Trolls are by our side this time.
ru: Не беспокойтесь, мой господин, мы снова сразимся плечо к плечу, и не оставим захватчикам ни единого шанса. Тролли теперь на нашей стороне.

source: So the trolls serve the elves? Never mind, they will perish too.
ru: Тролли служат эльфам? Ни когда бы не подумал, что они могут изменить своей природе.

source: Look there! The white whelp! Lord Denvan will pay us well if we capture it!
ru: Смотрите! Белый троллёныш! Лорд Денван щедро заплатит тому, кто схватит его!

source: True. Kill everybody but the white one. I want it alive!
ru: Да. Убить всех, но не белого. Он нужен мне живым!

source: The fog is falling, it will be easier for our hunting party to hunt the elves, when they come back from the North.
ru: Опускается туман - это облегчит нам задачу по охоте на эльфов, когда они вернутся с севера.

source: Shut up, you idiot!
ru: Заткнись, идиот!

source: Hunting party? That doesn't sound well...
ru: Охотники? Это звучит как то нехорошо...

source: Did you hear that sound? Was it a horn?
ru: Ты слышал этот звук? Похожий на горн?

source: A hunting horn. This means that their hunting party is coming. Pay double attention from now on, we don't know where they are or how many.
ru: Охотничий рог. Это значит что их охотничья свора приближается. Удвоим бдительность, мы не знаем где они и сколько их.

source: Anyway, we must defeat them as well, or they will ambush our village.
ru: Как бы то не было, мы должны разбить их, или они устроят засаду на деревню.

source: We are wasting too much time here, by now Denvan and his army will have reached our village.
ru: Мы потеряли слишком много времени, теперь Денван и его армия доберутся до деревни.

source: And most of our fighters are here, the village is vulnerable.
ru: А большинство наших бойцов тут, деревня беззащитна.

source: Our beautiful village is lost.
ru: Наша прекрасная деревня потеряна.

source: This was the last of them, these outlaws won't be a danger for our village anymore.
ru: Это был последний: разбойники больше не представляют опасности для деревни.

source: Now let us rush home.
ru: Теперь поспешим домой.

source: We have arrived just in time, but I fear this time our enemies are too many. Our army isn't big enough to face them. And look, they have hired more mercenaries. I hate their kind, only yearning for gold.
ru: Мы прибыли вовремя, но боюсь на этот раз врагов слишком много. Наша армия не слишком многочисленна для противостояния. И посмотри, они позвали ещё больше наёмников. Ненавижу этих типов, продадут родную мать за золото.

source: Yet we must at least try to defeat them. For our village, our families, our forest. For freedom!
ru: Мы должны хотя бы попытаться отбить их. За нашу деревню, за наши семьи, за наш лес. За свободу!

source: Humans! This is your last chance to retreat. If you enter our forest, you will not leave it alive. We have always honored our alliance, but now you are attacking our homes, you will not be unpunished.
ru: Люди! Это ваш последний шанс отступить. Если вы войдёте в наш лес, вы не выйдите живыми. Мы всегда чтили наши договорённости, но сейчас вы атакуете наши дома, а это не останется безнаказанным.

source: An alliance you call it? An act of submission I say! My weak father signed that reckless treaty because he was too coward to show you your real inferiority. But since I killed my father things have changed, now you will decide whether you surrender and serve me or you die today.
ru: Вы называете это договором? Узурпаторская кабалла, как по мне! Мой слабый отец подписал эту вздорную бумагу, поскольку был слишком труслив, что бы указать вам на ваше место. Но со времён, когда я заколол папашу, многое поменялось: и теперь вам решать — сдаваться и служить мне или всем подохнуть сегодня.

source: Let us not forget who has shown you how to fight the elves, and who will be the leader of the elvish village after this battle...
ru: Давайте не будем забывать, <i>кто</i> рассказал тебе о слабых местах эльфов, и <i>кого</i> назначат главным в эльфийской деревне после этой битвы...

source: Yes, sure, you will lead the village, but the terms of our treaty will be rewritten. You will only be another servant of mine, forget the independence you have had until today.
ru: Да, несомненно, ты возглавишь деревню, но условия нашего договора изменились. Ты будешь всего лишь ещё одним моим слугой, забывшим о независимости.

source: Hunthor, you were exiled because of your rebellion, and now you come back with an army? Try to do the right thing for one time. Haven't you seen how these humans treat you? Fight with your people, defend your village, and I'm sure your past actions will be forgiven.
ru: Гюнтер, ты был изгнан за восстание, и теперь вернулся с армией? Попробуй хоть раз поступить честно. Разве ты не замечаешь, что эти люди хотят предать тебя? Сражайся за своих соратников, защити свою деревню, и я уверен, твои проступки будут прощены.

source: No, Brandir, you have always been the favorite of the council, while I have always been regarded only as an hot-tempered fighter. And I could not live in the same village with a troll. Trolls are evil, and now you have brought more of them. You are betraying your people, you should be ashamed.
ru: Нет, Брендир, ты всегда был любимчиком совета, а меня ценили только как темпераментного бойца. И я не собираюсь жить в одной деревне с троллем. Тролли - зло, и ты принёс его ещё больше. Это ты предал свой народ, это тебе должно быть стыдно.

source: So would you prefer to live your life as a servant of that human? Who is betraying our people now? These trolls are our friends, they have helped us, unlike you, who turned against your people to serve the humans. There has been a time to talk, now it is time for you to pay for your crimes.
ru: И ты предпочтёшь жить, как слуга людей? Кто предаёт сейчас наших сородичей? Эти тролли наши друзья, они помогают нам, в отличие от тебя, обернувшегося против своих соплеменников для услужения людям. Время разговоров прошло, настало время заплатить за свои преступления.

source: Captain, we fought with you in the past, then we defended our village in your absence. Now we are at your orders again, and we will fight by your side until the end.
ru: Капитан, мы сражались под вашим началом в прошлом, когда защищали деревню. Теперь мы снова к вашим услугам, и мы на вашей стороне до конца.

source: My loyal soldiers, I know I can always count on you.
ru: Мои верные солдаты, я всегда мог положиться на вас.

source: Very well, you have chosen to die. I can't say I am sorry for your decision. And you, filthy mercenary!
ru: Очень хорошо, вы выбрали смерть. Не могу сказать, что жалею о таком вашем выборе. И ты, гнусный наёмник!

source: Yes, my Lord?
ru: Да, милорд?

source: You know why I pay you, so try to earn your gold. I will pay you well for every enemy you kill. Do you understand this concept or it is too difficult for you?
ru: Ты знаешь, за что я плачу тебе, так что отрабатывай золото. Я щедро заплачу за каждого убитого тобой врага. Ты понимаешь такую математику или это слишком сложно для тебя?

source: Yes, my Lord, I understand.
ru: Да, милорд, я понял.

source: If it wasn't for the gold you pay to me...
ru: Если бы не золото, которое ты платишь мне...

source: And now, my inferior, I have a task for you as well. Try not to disappoint me this time.
ru: И ещё, мой прислужник, у меня есть так же задание для тебя. Попытайся не разочаровать меня на этот раз.

source: Yes, General? What are your orders?
ru: Да, генерал! Какие будут приказы?

source: You stupid idiot, can't you see I have just promoted myself to Grand Marshal?
ru: Ты тупица, разве не заметил, что я только что повысил себя до генералиссимуса?!

source: Yes, my Lord, sorry, my Lord. And you are wearing a fine new armor as well.
ru: Да, милорд, простите, милорд. На вас и новые блестящие доспехи.

source: Yes, it is a fine armor indeed. I stole it from a dwarvish blacksmith years ago, and it makes me more powerful and stronger. But that's none of your business.
ru: Да, соглашусь - отличная броня. Я украл её у гномьего кузнеца много лет назад: она делает меня сильнее и могущественнее. Но это не твоё дело!

source: I want you to go ahead in the forest and catch the white troll. I want it alive, to use it as a weapon. If I treat it as a troll should be treated, I'm sure it will reveal the warlike nature of its race, and it will be deadly for every enemy. You got it, my inferior?
ru: Я хочу, что бы ты отправился в лес и поймал белого тролля. Я хочу его живьём, так что используй <i>это</i> в качестве оружия. Если я изучил его, как следует, то убеждён: он проявит себя в соответствии с воинственной природой своей расы, и будет смертельно опасен для любого врага. Ты улавливаешь мысль, мой прислужник?

source: Yes, my Lord, I go and catch the white troll.
ru: Да, милорд. Я пойду и поймаю белого тролля.

source: My Lord, if I can...
ru: Милорд, если я только...

source: Yes, my inferior? What do you want?
ru: Да, мой прислужник? Что тебе надобно?

source: You haven't assigned me any troops, how can I succeed?
ru: Вы не дали мне людей, как я могу всё сделать в одиночку?

source: Do you need troops to complete such a simple task? I don't think so... If you want troops, find them by yourself!
ru: Тебе нужны люди, что бы справиться с таким лёгким заданием? Я не думаю... Если тебе нужны помощники, найди их сам!

source: But... my Lord...
ru: Но... милорд...
