Repository: wescamp/White_Troll-1.12
Catalog: po/*.po
Languages: ru

source: We are aware of the monster you are raising, elf, and soon we will report to Lord Denvan. Don't try to stop us. Men, stay behind and face the elves, while I reach Tridel. The more of them you kill, the better. This is only a small border patrol, they don't have a big army ready.
ru: Мы обеспокоены чудищем, которое вы выращиваете, эльф, и вскоре сообщим об этом лорду Денвану. Не пытайся остановить нас. Ратники, останьтесь и задержите эльфов, пока я добегу до Триделя. Чем больше вы убьёте, тем лучше. Это всего лишь приграничный патруль, у них нет большой армии наготове.

source: You come into our forest and dare confront us after spying on us? None of you will leave our forest alive! Catch them! Nobody must escape or they will send their army immediately knowing that we are unprepared to face them.
ru: Вы пришли в наш лес и смеете препираться после того, как шпионили за нами? Ни кто из вас не уйдёт из нашего леса живым! Поймать их! Ни кто не должен уйти или они немедленно пошлют войска, зная что мы не готовы встретить их во всеоружии.

source: You managed to stop me, elves, but don't deceive yourself: by now, my Lord has already been informed of what you are doing in your village. You have won this battle, but our army is too strong for you! And the troll too will meet his fate...
ru: Вы смогли остановить меня, эльфы, но не обманывайтесь: мой господин уже проинформирован о происходящем в вашей деревне. Вы одержали победу в этой битве, но наша армия вам не по зубам! И тролль так же встретит свою судьбу...

source: What are you talking about?
ru: О чём ты толкуешь?

source: Eh eh... ack...
ru: Кхе-кхе... гх-хе-е-е...

source: He is dead.
ru: Он мёртв.

source: Don't let anybody escape!
ru: Не дайте никому сбежать!

source: Good, we have stopped the humans.
ru: Хорошо: мы остановили людей.

source: My Lord, it seems that somebody has managed to escape: there are traces leaving the forest, but they are very hard to notice. Whoever left them, he was not a human.
ru: Мой господин, кажется кому-то удалось скрыться: есть следы в лесу, но их весьма тяжело проследить. кто бы их не оставил - это был не человек.

source: This is very disturbing. Let's go back and report to the council.
ru: Это весьма тревожно. Вернёмся и доложим совету.

source: They are approaching their village, we must hurry to stop them!
ru: Они на подступах к деревне, мы должны поторопиться и остановить их!

source: One of them has reached their village... we have no reason to keep fighting, retreat! We will soon have to face their whole army and we are not ready for a full scale war!
ru: Один из них добежал до деревни... у нас нет причин продолжать бой, отступаем! Скоро на нас выступит полноценная армия, а мы не готовы к полномасштабной войне!

source: More humans are coming from the city! They are too many! Retreat!
ru: Ещё больше людей выступило из города! Их слишком много! Отступаем!

source: Your house is so deep in the woods. Why have you chosen to live so isolated?
ru: Твой дом так далеко в чаще. Почему ты избрала отшельническую жизнь?

source: I need peace to improve my magic talents.
ru: Мне нужно место для оттачивания моих магических умений.

source: I can see your house over there!
ru: Я могу разглядеть твой дом отсюда!

source: Yes, we are almost there.
ru: Да, мы почти пришли.

source: Finally home.
ru: Наконец дома.

source: It's a pity we cannot rest.
ru: Очень жаль - мы не можем отдыхать.

source: What there?
ru: Что тама?

source: Another goblin!? And he seemed to be in a hurry.
ru: Ещё гоблин?! Замечу: он торопится.

source: Another goblin!?
ru: Ещё гоблин?!

source: I haven't seen a goblin around here for many years. I wonder why they are here...
ru: Я не видала тут гоблинов много лет. Интересно, откуда они взялись...

source: No matter what they are doing. We must stop him and kill him. Everybody knows that it is forbidden to access elvish forests. If we allow goblins to access our forests, who knows what might arrive then.
ru: Не важно, чем они занимаются. Мы должны остановить и убить его. Всем известно, что в эльфийский лес доступ закрыт. Если мы позволим гоблинам бродить по нашим лесам, кто знает - что может полезть вслед за ними.

source: Goblins, what are they doing in our lands?
ru: Гоблины? Что они забыли в наших землях?

source: And so close to my home!
ru: И так близко к моему дому!

source: Let us hurry.
ru: Нужно торопиться.

source: Here he is! We must catch him!
ru: Вон он! Мы должны поймать его!

source: I think he went into that cave.
ru: Я думаю, он заполз в эту пещеру.

source: Perfect! He will not have a way out. Let's catch him!
ru: Превосходно! Оттуда нет выхода. Давайте изловим его!

source: Here cave, wolf be in.
ru: Вот пещера, и волк в ней.

source: Here is the cave, the goblin must be inside.
ru: Вот пещера, гоблин должно быть прячется внутри.

source: I have never entered this cave before, who knows what hides inside...
ru: Я ни когда не заходила в эту пещеру, кто знает, что скрывается внутри...

source: It might be dangerous, be careful.
ru: Это может быть опасно, осторожно.

source: Argh!
ru: Эргх!

source: Very well, we killed their boss!
ru: Очень хорошо, мы убили их главаря!

source: That wasn't their boss. For sure there are more of them.
ru: Это не их главарь. Уверен дальше их ещё больше.

source: There's a druid locked in a cage!
ru: Тут друид, запертый в клетке!

source: We must help him!
ru: Мы должны помочь ему!

source: These goblins captured me! One of them has the key to open the cage!
ru: Эти гоблины пленили меня! Один из них прячет ключ от клетки у себя!

source: Thank you for your help.
ru: Благодарю за помощь.

source: You are welcome.
ru: К вашим услугам.

source: But I see that your girlfriend is a shaman. Maybe I could do something to repay you.
ru: Но я вижу, что твоя подружка - шаманка. Возможно, я найду, чем отблагодарить вас.

source: <i>(blushing)</i> What?!
ru: <i>(краснеет)</i> Что?!

source: Not now, child. First we must finish the work here.
ru: Не сейчас, малыш. Сначала мы должны завершить работу тут.

source: Don't call me child!
ru: Не называй меня малышкой!

source: Ah, I almost forgot. Summoning!
ru: А, чуть не забыл. Призываю!

source: Ahh, much better.
ru: О-ох, так намного лучше.

source: What? You could have created an army of these things at any time, so why did you wait for us to rescue you?
ru: Что? Если ты мог создать армию этих существ в любое время, почему ты ждал, пока мы спасём тебя?

source: Not at <i>any</i> time. You see, dear General...
ru: Не в <i>любое</i> время. Видите ли, дорогой генерал...

source: I'm not a General!
ru: Я не генерал!

source: You aren't? Well, they'll make you one. As I was saying, dear Lieutenant...
ru: Разве нет? Что же, они должны повысить вас. Как я уже сказал, дорогой <i>лейтенант</i>...

source: Here we go again...
ru: Ну вот, опять...

source: ... certain metals disrupt magic. As your girlfriend knows...
ru: ...некоторые металлы рассеивают магию. И как известно твоей подружке...

source: She's not my girlfriend!
ru: Она мне не подружка!

source: ... iron ruins Elvish magic. But perhaps you don't know that copper nullifies <b>my</b> magic, and that cage was made of copper. All clear, dear Colonel?
ru: ... железо разрушает эльфийскую магию. Но вы наверняка не знали, что медь нивелирует <b>мою</b> магию, а клетка была из меди. Всё ясно, дорогой <i>полковник</i>?

source: Why does he keep confusing grades?
ru: Почему он продолжает смущающие речи?

source: We did it!
ru: Мы сделали это!

source: Yes, and we have found a new ally. By the way, how can you create those creatures from nothing?
ru: Да, и мы приобрели нового союзника. Кстати, как ты воплощаешь эти создания из ничего?

source: Good question, Child. I need to find more ingredients for my potions or these useful mushrooms I picked in this cave will become almost worthless... If you follow me west through the forest, I can teach you things.
ru: Хороший вопрос, малыш. Мне нужно найти больше ингридиентов для моих зелий или эти прекрасные грибы, что я нашёл в пещере, будут практически бесполезны... Если вы отправитесь со мной в лес, я обучу вас некоторым вещам.

source: Actually we have another task, we have to keep Melime and Eruannon safe...
ru: Вообще-то, у нас другая задача, нам нужно обезопасить Мелим и Эруаннона...

source: Think about it Brandir, if we go with him we would be far from any conflict and nobody would know where we are. It's the safest thing we could do at this moment.
ru: Поразмысли над этим, Брендир, если мы отправимся с ним, мы будем вдалеке от любых проблем и ни кто не прознает где мы. Это безопаснейший путь на данный момент.

source: Melime, please, try to reason... This old man is crazy, we can't put our lives in his hands, we don't know what's in his head but I'm sure it's nothing sane. And then, what is it that he wants to teach you? Why can't he do it here?
ru: Мелим, прошу, попытайся понять... Этот старик не в себе, мы не можем доверить ему наши жизни, мы не знаем, что у него в голове, но я уверен - ни чего хорошего. И ко всему, чему он собрался учить тебя? Почему это нельзя сделать тут?

source: Too many questions, Brandir. I trust you and I'm sure you will protect me well in any case.
ru: Слишком много вопросов, Брендир. Я доверяю тебе и я уверена - ты всегда оградишь меня от бед.

source: We go! Old man make flames, me make flames... Me like old man!
ru: Мы дойти! Старый человек делать огонь, я делать огонь... Я как старый человек!

source: Oh well... I see you are all against me... But let us be careful.
ru: Ну ладно... Я вижу вы все перечите мне... Но что бы все соблюдали осторожность.

source: I fear we got lost in these caves...
ru: Я боюсь, мы заблудимся в этих пещерах...

source: So, Delson, where do we go now? And what is it that you wanted to teach Melime?
ru: Итак, Делсон, куда теперь отправимся? И чему вы собираетесь обучать Мелим?

source: Where do we go? Interesting questions, lad. There should be a pond whose waters should be ideal for my potions. What I want to do is reach this lake and use its water, and teach your girlfriend...
ru: Куда отправимся? Интересный вопрос, приятель. Тут неподалёку должен быть пруд, воды которого идеально подходят для моих зелий. Я хочу дойти до озера и набрать воды, и обучить твою подружку...

source: I'm not his girlfriend!
ru: Я не его подружка!

source: ...how to summon creatures. She has the magical talent to learn. Maybe we can start now... Look at this! Summoning!
ru: ...как призывать созданий. У неё определённо талант к магии. Может она начнёт сейчас... Смотри! Призываю!

source: What a beautiful scorpion I made this time! Now tell me, child, do you want to learn?
ru: Какой чудесный скорпион получился в этот раз! Теперь скажи мне, малыш, ты хочешь обучаться?

source: Of course I want to learn. But don't call me child!
ru: Конечно, я хочу обучаться. Но не называй меня малыш!

source: Very well, child, take some of my herbs, put them on the ground and utter the spell concentrating your power on the creature you want to create...
ru: Очень хорошо, малыш, возьми немного моих трав, положи их на землю и произнеси заклинание, сконцентрировав разум на образе существа, которое желаешь создать...

source: I... S... Summoning!
ru: Я...При... Призываю!

source: Not bad for a first attempt, child, but you didn't concentrate enough and the creature disappeared.
ru: Не плохо для первого раза, малыш, но ты не достаточно сконцентрировалась и существо испарилось.

source: Me try too... Sumoing!
ru: Я тоже пробовать... Пр-р-ризыв!

source: Oh oh, what do we have here?? The white pet can summon better than you, child!
ru: Хо-хо, что тут у нас? Белый питомец может призывать лучше чем ты, малыш?

source: I will try again! It seems that Eruannon is able to control elements he has an affinity with, such as mud and maybe rock. We should help him develop his power.
ru: Я попробую снова! Похоже Эруаннон может контролировать элементы с которыми связан, как глина или, возможно, камни. Мы должны помочь развить эти силы.

source: Melime, Delson and Eruannon are now able to summon creatures, but this will cost them mana points. To summon a creature, right-click on a free tile near one of them, and select the summoner you want to use. If they have enough mana you will be prompted with a list of units to choose. Note that Melime, Delson and Eruannon are able to summon different types of creatures. Please note that mana can be recovered in the following ways: • 1 mana point at the start of every turn • 2 mana points if the unit rested • in case of early finish, 2 mana points per spared turn Note also that, due to the ephemeral nature of the summoning spell, the summoned creatures will vanish at the end of each scenario.
ru: Мелим, Делсон и Эруаннон теперь могут призывать существ, но это стоит им очков маны. Для призыва существа, сделайте правый клик на свободную клетку рядом с героем, и выберите призываемого на ваш вкус. Если у вас достаточно маны, появится список призываемых существ. Заметьте, что Мелим, Делсон и Эруаннон призывают разные типы существ Пожалуйста обратите внимание, что мана восстанавливается так: • +1 единица маны в начале каждого хода • +2 единицы маны, если боец отдыхал • в случае быстрого финиша, +2 единицы маны за каждый неиспользованный ход Заметим так же, что эфемерная природа призывных заклинаний заставляет существ рассеиваться в конце каждого сценария.

source: Very well, I guess you both have to practice. Try to summon some units and control them. In the meantime we can move towards our destination. We should move West and then North to cross a mountain pass, to descend later and find the lake.
ru: Очень хорошо, хотя я думаю вам двоим стоит ещё поработать. Попробуйте призвать несколько бойцов и поуправляйте ими. В тоже время мы можем двигаться вперёд к нашей цели. Нам нужно идти на запад, а затем на север, пройти через перевал, спуститься в долину и найти пруд.

source: Very good, child! It seems that you and your strange pet have managed to master the art of summoning. And I have found everything I needed for my potions.
ru: Очень хорошо, малыш! Как погляжу ты и твой питомец достигли мастерства в призывании. И я нашёл всё, что нужно для своих снадобий.

source: So we can finally leave this abandoned place?
ru: И мы наконец можем покинуть это заброшенное место?

source: You will leave. I plan on residing here for the next months. These wolves will be a nice addition to my summoning spells, but I need to study them well before, or I risk creating a three-headed dog! And this place offers all the wolves I need to study. And this water is really great!
ru: Вы можете идти. У меня же в планах провести здесь ближайшие месяцы. Эти волки станут отличным дополнением к моим призывным заклинаниям, но прежде я должен их препарировать, иначе рискую получить трёхголового пса! В этом месте есть все виды волков, которых я хотел бы изучить. И эта вода просто великолепна!

source: So I guess this is a farewell... It's been a pleasure to meet you, and I sincerely thank you for what you have taught me.
ru: Так значит это прощание... Было весьма приятно встретить тебя, и я сердечно благодарю за всё, чему ты меня научил.

source: You are welcome, but never say farewell, you never know what's going to happen.
ru: Всегда пожалуйста, но не говори прощай, никогда не знаешь, что может произойти.

source: I have found the water I was looking for, but you are still unable to summon properly. We should train you some more before we come back here!
ru: Я нашёл нужную мне воду, но ты всё ещё не можешь достойно призывать. Нужно побольше потренировать тебя перед возвращением!

source: I'm surprised, you proven unable to learn how to summon creatures... I just wasted my time with you.
ru: Я поражён, ты даже не можешь выучить, как призывать существ... Я просто теряю время.

source: That's the cave where we found Delson, we have no need to go there now.
ru: Это пещера, в которой мы нашли Делсона, нам теперь не нужно туда.

source: Not that way! I told you we must move West and then North!
ru: Не туда! Я же сказал: нам нужно отправляться <i>на запад</i> и <u>затем</u> <i>на север</i>!

source: It seems we found a wolf lair!
ru: Похоже, мы наткнулись на волчье логово!

source: And these wolves are so big! And they look everything but friendly!
ru: И эти волки такие большие! И выглядят как угодно, но не дружелюбно!

source: An old house is built just on the top of the pass. I wonder if it's inhabited...
ru: Старая хибара, построенная на вершине перевала. Я надеюсь - необитаема...

source: I doubt that someone could live in a place like that.
ru: Недумаю, что найдётся безумец, желающий поселиться здесь.

source: I would love to live here!
ru: Я хотел бы жить тут!

source: Who are you? Leave my home now!
ru: Кто вы такие? Я вас не знаю! Идите... прочь!

source: We were only passing by, but we were attacked by wild creatures. Can you give us shelter?
ru: Мы просто проходили мимо, но были атакованы дикими зверями. Не могли бы вы дать нам приют?

source: No way! I live here because those you call wild creatures are my friends. I won't help you to harm them. Go away!
ru: Ни как нет! Я живу тут, поскольку те, кого вы зовёте дикими зверями - мои друзья. Я не собираюсь помогать вам браконьерничать. Убирайтесь!

source: More goblins?? How did they arrive here?
ru: Ещё гоблины? Как они добрались сюда?

source: Probably that cave has another access...
ru: Наверняка эта пещера имеет другой вход...

source: Here's the other access to the cave...
ru: Вот и другой вход в пещеру...

source: Good, your progress has been incredible!
ru: Хорошо! Твой прогресс был невероятен!

source: The path is ascending, we are about to reach a pass.
ru: Дорога поднимается, мы почти дошли до перевала.

source: Yes, my friend. I told you. We must climb the mountain until we reach the pass, and then descend on the other side.
ru: Да, мой друг. Я говорил вам: мы должны забраться на гору, пройти перевалом, и спуститься с другой стороны.

source: It's going to be a hard climb...
ru: Это будет тяжёлым подъёмом...

source: Oh wonderful... we just needed an earthquake... as usual, it never rains but it pours!
ru: О, великолепно... всё что нам нужно - землетрясение... как всегда, пришла беда - отворяй ворота!

source: Hey... All right up there?
ru: Эгей... Там всё в порядке?

source: Yes, we're all right! But this fortress was already a wreck, now it needs only a sneeze to go down! I see our enemies preparing their weapons, come here before them!
ru: Да мы в порядке! Но эта крепость на грани разрушения, достаточно одного чиха, что бы всё осыпалось! Я смотрю, наши враги позаботились об оружии, бывшем тут до них!

source: We can't reach you, the bridge has fallen!
ru: Мы не сможем перебраться к тебе, мост обвалился!

source: Pinecones...
ru: Толстый пушной...

source: Let's see... maybe we can try fixing the bridge with some ropes, but it'll take some time.
ru: Так, дай глянуть... может мост удастся наладить при помощи нескольких верёвок, но потребуется время.

source: Damn... we didn't need this issue, and the next point where we can reach back our forest is too far away.
ru: Зверь песец... некогда морочиться с мостом, и, как назло, следующее место, где можно вернуться обратно в лес - слишком далеко.

source: Understood...
ru: Понял...

source: Well, we still have enough swords and arrows to keep these brutes away. You stay there and try to prepare a makeshift bridge with ropes and planks of wood, so we can pull it down after we cross it.
ru: Что же, у нас всё ещё достаточно мечей и стрел, что бы держать этих предателей на расстоянии. Ты останешься здесь и попробуешь наладить подвесную переправу из верёвок и деревянных досок, что бы мы могли обрубить её, когда перейдём.

source: We'll try to do as fast as possible.
ru: Попытаемся сделать всё как можно быстрее.

source: I hope so... I have just seen a scout being sent out from their encampment. I don't like this at all.
ru: Я надеюсь на вас... Я только что видела гонца, посланного из их лагеря. Не нравится мне всё это.

source: We'll start working right now.
ru: Мы начнём работу прямо сейчас.

source: I'll chop some wood.
ru: Я нарублю веток.

source: And I'll start untangling the ropes. But when I packed them, they were all plain and straight, now they're all knots. How weird.
ru: А я буду распутывать верёвки. Странно: когда я укладывала их, они были ровными и аккуратными, а теперь все в узлах. Весьма загадочно.

source: If I'll ever survive this mess, I swear that I'll light up a gigantic candle for Eloh in the nearest sanctuary...
ru: Если я только выживу в этой кровавой бане, клянусь я поставлю самую большую свечку Эло в первом встреченном храме...

source: What's going on here, my inferior? You can't get rid of some tree-hugging amateurs, can you?
ru: Что случилось, прислужник? Не можешь расправиться с несколькими любителями обнимать деревья?

source: Eh... uh... really...
ru: Кхе... ох... правда...

source: It looks like I have to handle the situation by myself, as usual. Why am I surrounded by a bunch of incompetent minions?
ru: Похоже, нужно брать ситуацию в свои руки, впрочем, как всегда. Почему меня окружают толпы никчёмных холопов?

source: If I can say, my Lord, I think that...
ru: Если мне позволено будет сказать, милорд, я думаю что...

source: My question did not need an answer! And you are here to act, not to think!
ru: Мой вопрос - риторический... и не требует ответа! А ты тут - что бы действовать, а не рассуждать!

source: The sooner we can flee, the better...
ru: Чем быстрее мы сможем сбежать, тем лучше...

source: Aaahhhh!
ru: А-а-ааа-х!

source: It seems like he had some gold with him...
ru: Похоже при нём было немного золота...

source: You retrieve 100 gold pieces!
ru: Вы приобрели 100 золотых!

source: So, you tree-huggers killed my inferior. Oh well, I was planning to demote him as a potato peeler anyway.
ru: Значит, эти древолюбы убили моего прислужника. Ну и ладно, я всё равно собирался сослать его на кухню чистить картофель.

source: I have a deal: surrender now and I'll just behead you, instead of making your death painful. Agreed?
ru: Предлагаю сделку: сдавайтесь немедленно и я просто отрублю ваши головы, вместо придания долгой и мучительной смерти. По рукам?

source: Come here and try to defeat us... if you can!
ru: Приди и возьми нас... если сможешь!

source: Such a shame... You'll see what happens to those that refuse a deal with Lord Denvan!
ru: Какой вздор... Вы узрите что бывает с теми, кто отказывает лорду Денвану!

source: The bridge is ready!
ru: Мост готов!

source: Everyone, retreat!
ru: Эй все! Отступаем!

source: The tree-huggers fled. I am disappointed, my dear inferior. I am really disappointed.
ru: Эти древолюбы сбежали. Я разочарован, мой дорогой прислужник. Крайне разочарован.

source: Please, no...
ru: Пожалуйста, не...

source: But worry not, for this will be the last time that you disappoint me. <big><b>Martial court!</b></big>
ru: Но не о чем беспокоиться - это был последний раз, когда ты разочаровываешь меня. <big><b>Палач!</b></big>

source: Aaaaahhhh!
ru: А-а-ааа-х!

source: As for you, tree-huggers, I swear that we will meet again... or maybe not, if my servants that control the forest catch you first!
ru: Что до вас, древолюбы, клянусь: мы встретимся снова... или нет, если подчинённые мне обитатели этого леса поймают вас раньше!

source: Flee, tree-huggers, flee while you can. We will meet again... or maybe not, if my servants that control the forest catch you first!
ru: Бегите, древолюбы, бегите пока можете. Мы встретимся вновь... или нет, если подчинённые мне обитатели этого леса поймают вас раньше!

source: Finally out of the river! I'm so cold!
ru: Наконец вышли из реки! Мне так холодно!

source: Me make fire!
ru: Я добывать огонь!

source: Aah, much better. Thank you, Eruannon.
ru: А-ах, так намного лучше. Благодарю, Эруаннон.
